a = 'слон'
c = a[2] + a[3]
# print(c*3)
# ---------------
a = 'Привет'
# print(a[0] + a[2] + a[1],  a[3] + a[2] + a[3] + a[2])
# ---------------
a = 'Ура'
c = a[0] + a[2] + ' '
# print(c*5 + a)
# ---------------
a = 'armageddon'
b = (a[2] + a[5])*2
# print(a[6] + a[8] + a[4] + a[5], b)
# ---------------
a ='Кстати,давно не виделись.Привет!'
c = a.find(' ')
# print(c)
# ---------------
a ='Кстати,давно не виделись.Привет!'
c = a.find('!')
# print(c)
# ---------------
# a = 'Добрый вечер'
# b = 'Доброе утро'
# c = a.find('ы')
# d = b.find('у')
# print(c)
# print(d)
# ---------------
a = "Кстати, давно не виделись. Привет!"
b = a.replace(" ","_")
print(b)
# ---------------
a = 'Кстати,_давно_не_виделись._Привет!'
b = a.count('_')
print(b)
# ---------------
a = "Кстати, давно не виделись. Привет!"
b = a.replace('и', 'И')
print(b)
# ---------------
a = 'Троло-ло-ло-ло'
b = a.replace('о', 'а')
print(b)
# ---------------
# message = input()
# if message == 'Привет!':
#     print('Привет!')
# elif message == 'Как дела?':
#     print('Хорошо')
# elif message == 'Чем занимаешься?':
#     print('Работаю,не покладая рук')
# else:
#     print('Даже не знаю что сказать')
# # ---------------
